var rule ={
            title: '溏心次元',
            host: 'https://txcy-online.buzz/',
            //https://0t6a6ag0r6.txcyvip.buzz/index.php/actordetail/1.html
           // https://txcy-online.buzz/index.php/actordetail/1.html
            url: 'https://txcy-online.buzz//index.php/actordetail/fyclass.html',
            class_name:'吴梦梦&沈娜娜&艾艾&艾拉&艾鲤&艾秋&艾熙&安娜&白佳莹&白金&白靖寒&白鹿&白沛瑶&瑶贝&白若冰&白思吟&陈可心&陈美琳&陈小雨&程诗诗&楚梦舒&杜冰若&方紫璐&付妙菱&高小颜&顾桃桃&顾依梦&管明美&郭童童&韩宝儿&韩诗雨&韩棠&韩熙&韩伊人&韩子妍&胡心瑶&季妍希&简一&周梦琪&周甯&周卿卿&金丞熙&赖昀希&岚湘庭&蓝歆悦&乐乐&黎儿&黎星若&李靖琪&李曼妮&李慕儿&李娜&李蓉蓉&李小婵&李允熙&梁芸菲&林芊彤&林思妤&林襄&林晓雪&林雪漫&林嫣&林怡梦&林亦涵&凌薇&刘豆豆&刘思慧&刘依依&刘语姗&陆思涵&陆子欣&罗瑾萱&斑斑&孟若羽&米亚&蜜苏&莫夕慈&莫潇潇&慕非非&穆雪&南芊允&倪哇哇&宁洋子&欧美玲&欧妮&潘雨曦&秦可欣&沈芯语&舒可芯&宋南伊&宋妮可&颂潮&苏畅&苏念瑾&苏清歌&苏小新&苏娅&苏语棠&孙缇娜&谭瑛瑛&檀雅&唐霏&唐雨婕&陶白白&陶子&娃诺&王茜&温芮欣&文冰冰&翁雨澄&娃娃&吴茜茜&吴芮瑜&夏晴子&夏瀅&夏禹熙&仙儿媛&项子宁&徐蕾&徐韻珊&许安妮&许书曼&许依然&宣萱&璇元&雪莉&雪千夏&寻小小&杨玉环&叶如梦&叶一涵&苡若&尹媚&袁采菱&袁子仪&玥可岚&张妮妮&张婉妍&张小九&张娅庭&张芸熙&赵佳美&赵一曼&赵颖儿&锺丽琪&锺宛冰&STACY&玖玖&乐奈子&黎娜&吴芳宜&夜夜&尤莉&羽芮',
 class_url:'1&2&3&4&5&6&7&8&9&10&11&12&13&14&15&16&17&18&19&20&21&22&23&24&25&26&27&28&29&30&31&32&33&34&35&36&37&38&39&40&41&42&43&44&45&46&47&48&49&50&51&52&53&54&55&56&57&58&59&60&61&62&63&64&65&66&67&68&69&70&71&72&73&74&75&76&77&78&79&80&81&82&83&84&85&86&87&88&89&90&91&92&93&94&95&96&97&98&99&100&101&102&103&104&105&106&107&108&109&110&111&112&113&114&115&116&117&118&119&120&121&122&123&124&125&126&127&128&129&130&131&132&133&134&135&136&137&138&139&140&141&142&143&144&145&146&147&148&149&150&152&152&153&154',
  
            //class_parse: 'body&&.tx-wide&&.header&&.nav&&.tx-flex-hc&&li;a&&Text;a&&href;.*/(.*?).html',
            searchable: 2,
            quickSearch: 0,
            filterable: 0,
            headers: {
                'User-Agent': 'MOBILE_UA',
            },
            play_parse: true,
            lazy: '',
            limit: 6,

            double: true,
           // 一级: 'body&&.video-item&&li;img&&src;a&&style;a&&Text;a&&data-url',
                一级: 'body&&.tx-wide&&.row&&li;.f-15&&Text;img&&src;img&&alt;a&&href',
            二级: '*',
            搜索: '.s-tab-main&&li;.js-tongjic&&title;img&&src;.hint&&Text;a&&href;.pay&&Text',
        }
        